In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [3]:
df.head()

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

##### 1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column(instead of a float column).

In [4]:
new_index=np.arange(1,df.From_To.count()+1)

In [5]:
new_index

array([1, 2, 3, 4, 5])

In [6]:
df.set_index(new_index,inplace=True)
df.head(2)

             Airline  FlightNumber       From_To RecentDelays
1             KLM(!)       10045.0  LoNDon_paris     [23, 47]
2  <Air France> (12)           NaN  MAdrid_miLAN           []

In [7]:
for i in np.arange(1,df.From_To.count()+1):
    if pd.isnull(df.FlightNumber.loc[i]):
        df['FlightNumber'].loc[i]=df['FlightNumber'].loc[i-1]+10
        #print(i)

/home/akash/anaconda2/lib/python2.7/site-packages/pandas/core/indexing.py:189: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [8]:
df

               Airline  FlightNumber           From_To  RecentDelays
1               KLM(!)       10045.0      LoNDon_paris      [23, 47]
2    <Air France> (12)       10055.0      MAdrid_miLAN            []
3  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
4       12. Air France       10075.0    Budapest_PaRis          [13]
5          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

##### 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [9]:
df[['From','To']]= df.From_To.str.split("_",expand=True)

In [10]:
df=df[['From_To', 'From', 'To', 'FlightNumber', 'RecentDelays', 'Airline']]

In [11]:
df.head()

,From_To,From,To,FlightNumber,RecentDelays,Airline
1,LoNDon_paris,LoNDon,paris,10045.0,"[23, 47]",KLM(!)
2,MAdrid_miLAN,MAdrid,miLAN,10055.0,[],<Air France> (12)
3,londON_StockhOlm,londON,StockhOlm,10065.0,"[24, 43, 87]",(British Airways. )
4,Budapest_PaRis,Budapest,PaRis,10075.0,[13],12. Air France
5,Brussels_londOn,Brussels,londOn,10085.0,"[67, 32]","""Swiss Air"""

##### 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [12]:
df['From']=df['From'].str.lower()
df['From']=df['From'].str.capitalize()

In [13]:
df['To']=df['To'].str.lower()
df['To']=df['To'].str.capitalize()

In [14]:
df['From_To']=df['From_To'].str.lower()
df['From_To']=df['From_To'].str.capitalize()

In [15]:
df.head()

,From_To,From,To,FlightNumber,RecentDelays,Airline
1,London_paris,London,Paris,10045.0,"[23, 47]",KLM(!)
2,Madrid_milan,Madrid,Milan,10055.0,[],<Air France> (12)
3,London_stockholm,London,Stockholm,10065.0,"[24, 43, 87]",(British Airways. )
4,Budapest_paris,Budapest,Paris,10075.0,[13],12. Air France
5,Brussels_london,Brussels,London,10085.0,"[67, 32]","""Swiss Air"""

### 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [16]:
df.drop('From_To',axis=1,inplace=True)
df.head()

       From         To  FlightNumber  RecentDelays              Airline
1    London      Paris       10045.0      [23, 47]               KLM(!)
2    Madrid      Milan       10055.0            []    <Air France> (12)
3    London  Stockholm       10065.0  [24, 43, 87]  (British Airways. )
4  Budapest      Paris       10075.0          [13]       12. Air France
5  Brussels     London       10085.0      [67, 32]          "Swiss Air"

### 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [17]:

df[['RecentDelays1','RecentDelays2','RecentDelays3']]= pd.DataFrame(df.RecentDelays.tolist(), index= df.index)

In [20]:
df.drop('RecentDelays',axis=1,inplace=True)

In [22]:
df=df[[u'From', u'To', u'FlightNumber',  u'RecentDelays1',
       u'RecentDelays2', u'RecentDelays3',u'Airline']]

In [23]:
df

,From,To,FlightNumber,RecentDelays1,RecentDelays2,RecentDelays3,Airline
1,London,Paris,10045.0,23.0,47.0,NaN,KLM(!)
2,Madrid,Milan,10055.0,NaN,NaN,NaN,<Air France> (12)
3,London,Stockholm,10065.0,24.0,43.0,87.0,(British Airways. )
4,Budapest,Paris,10075.0,13.0,NaN,NaN,12. Air France
5,Brussels,London,10085.0,67.0,32.0,NaN,"""Swiss Air"""